Desafio/app/views/tabela_desafios/index.html.erb

SELECT "tabela_desafios".* FROM "tabela_desafios"
SELECT SUM("tabela_desafios"."valor_total") FROM "tabela_desafios"
---
</table>
	<p>Valor total dos pedidos: R$ <%= TabelaDesafio.sum(:valor_total) %>