Desafio/app/controllers/tabela_desafios_controller.rb

SELECT "tabela_desafios".* FROM "tabela_desafios"
---
  def index
    @tabela_desafios = TabelaDesafio.all

INSERT INTO "tabela_desafios" ("comprador", "valor_total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comprador", "\n"], ["valor_total", 0.0], ["created_at", "2017-05-22 19:43:06.181724"], ["updated_at", "2017-05-22 19:43:06.181724"]]
---
    def create
      if params[:file] == nil
        redirect_to tabela_desafios_path
        flash[:notice] = "Arquivo não escolhido"
        else
          if params[:file].original_filename == 'dados.txt'
            uploaded_file = params[:file]
            if uploaded_file.open.readlines.drop(1).each do |line|
            columns = line.split("\t")
            @valor_total = (columns[2].to_f*columns[3].to_i)
            TabelaDesafio.create(:comprador => columns[0], :descricao => columns[1], :preco_unit => columns[2], :quantidade => columns[3], :endereco => columns[4], :fornecedor => columns[5], :valor_total => @valor_total)

SELECT  "tabela_desafios".* FROM "tabela_desafios" WHERE "tabela_desafios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tabela_desafios" WHERE "tabela_desafios"."id" = ?  [["id", 1]]
---
  def destroy
      @tabela_desafio = TabelaDesafio.find(params[:id])
    if  @tabela_desafio.present?
       @tabela_desafio.destroy